In [3]:
import pandas as pd
#fd-> data frame -> roes + columns
# This add this folder to the execution path to be able to import the .py archive
import os
print(os.getcwd())
import sys
sys.path.append(r"Desktop/Data Engineer-IBM-Coursera/Curse 2_Python/Jupyter_notebooks")

from text_analyzer import TextAnalyzer

string = TextAnalyzer("VoilÃ ! In view, a humble vaudevillian veteran, cast vicariously as both victim and villain by the vicissitudes of Fate. This visage, no mere veneer of vanity, is it vestige of the vox populi, now vacant, vanished.However, this valorous visitation of a bygone vexation stands vivified, and has vowed to vanquish these venal and virulent vermin, vanguarding vice and vouchsafing the violently vicious and voracious violation of volition. The only verdict is vengeance; a vendetta, held as a votive not in vain, for the value and veracity of such shall one day vindicate the vigilant and the virtuous.Verily, this vichyssoise of verbiage veers most verbose, so let me simply add that it is my very good honor to meet you and you may call me V.")

freqMap = string.freqAll()

table = pd.DataFrame(list(freqMap.items()), columns=['Word', 'Frequency'])
table = table.sort_values(by='Frequency', ascending=False).reset_index(drop=True)
print(table.head(10))

C:\Users\lenno\Desktop\Data Engineer-IBM-Coursera\Curse 2_Python\Jupyter_notebooks
   Word  Frequency
0   and          8
1    of          7
2   the          7
3     a          4
4    is          3
5  this          3
6    it          2
7    to          2
8    me          2
9   you          2

In [5]:
df1 = table[table['Frequency']>3]
print(df1)
#save as csv

df1.to_csv('highest_freq.csv')

  Word  Frequency
0  and          8
1   of          7
2  the          7
3    a          4

In [6]:
#Define a dictionary 'x'

x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

#casting the dictionary to a DataFrame
df = pd.DataFrame(x)

#display the result df
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [7]:
x = df[['ID']]
x
type(x)
z =df[['Department','Salary','ID']]
z

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4

In [8]:
A = {'Student': ['David','Samuel','Terry','Evan'], 'Age': [27,24,22,32], 'Country':['UK','Canada', 'China', 'USA'], 'Course':['Python', 'Data Structures','Machine Learning','Web Development'],'Marks':[85,72,89,76]}
dfA = pd.DataFrame(A)
dfA

  Student  Age Country            Course  Marks
0   David   27      UK            Python     85
1  Samuel   24  Canada   Data Structures     72
2   Terry   22   China  Machine Learning     89
3    Evan   32     USA   Web Development     76

In [9]:
b = dfA[['Marks']]
b
c= dfA[['Country','Course']]
c
#Column as a series
d=dfA['Age']
d

0    27
1    24
2    22
3    32
Name: Age, dtype: int64

# loc() iloc() functions
loc() is a label-based data selecting method which means that we have to pass the name of the row or column that we want to select. This method includes the last element of the range passed in it.

In [33]:
# Access the value on the first row and the first column
dfA.iloc[0,0]

'UK'

In [36]:
# Access the column using the name
dfA.loc[0,'Age']

np.int64(27)

In [15]:
df2 = df
# Set the column "Name" as de index
df2 = df2.set_index("Name")
df2.head()

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [33]:
x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}
df = pd.DataFrame(x)
df2=df
df2=df2.set_index("Name")
df2.head()

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [34]:
df2.loc['Jane','Department']

'Design Team'

In [35]:
df2.iloc[3,2]

np.int64(60000)

In [36]:
df2.iloc[0:2,0:3]

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000

In [39]:
df.loc[0:2,'ID':'Department']

   ID       Department
0   1  Architect Group
1   2   Software Group
2   3      Design Team

In [40]:
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [41]:
df.loc[2:3, 'Name':'Department']

   Name  ID      Department
2  Jane   3     Design Team
3  Mary   4  Infrastructure

# Lets load Data with Pandas

In [43]:
csv_path = 'https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/LXjSAttmoxJfEG6il1Bqfw/Product-sales.csv'
df = pd.read_csv(csv_path)

In [47]:
xlsx_path = 'https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/n9LOuKI9SlUa1b5zkaCMeg/Product-sales.xlsx'
df = pd.read_excel(xlsx_path)
df.head()

,OrderID,Product,Category,Quantity,Price,Total,OrderDate,CustomerCity
0,1,Laptop,Electronics,2,800,1600,2022-01-10,New York
1,2,Smartphone,Electronics,3,600,1800,2022-02-15,Los Angeles
2,3,Desk Chair,Furniture,5,150,750,2022-03-12,Chicago
3,4,Notebook,Stationery,10,2,20,2022-04-05,Houston
4,5,Monitor,Electronics,1,300,300,2022-05-21,Miami

In [50]:
# Get a column as a serie
x = df[['Product']]
x

pandas.core.frame.DataFrame

In [52]:
#Multiple columns
df

,OrderID,Product,Category,Quantity,Price,Total,OrderDate,CustomerCity
0,1,Laptop,Electronics,2,800,1600,2022-01-10,New York
1,2,Smartphone,Electronics,3,600,1800,2022-02-15,Los Angeles
2,3,Desk Chair,Furniture,5,150,750,2022-03-12,Chicago
3,4,Notebook,Stationery,10,2,20,2022-04-05,Houston
4,5,Monitor,Electronics,1,300,300,2022-05-21,Miami

In [59]:
df.iloc[3,4]

np.int64(2)